Autodesk.Revit.DB.WorkerProgressNotifier.MarkProgress
Sends a heart beat signal of the current calculation progress
Remarks:
Any secondary data calculation is required to keep the main process informed about its progress. If the main
process does not detect the heart beats within the limit WorkerServicesExecutive::WorkerCalculationTimeout
(15 seconds), the calculation is deemed failed and rolled over in the main process.
By default, the cross-process element access would call this method. If your secondary data calculation does not
access elements and the algorithm is long enough to exceed the time limit, you need explicitly call this method
to avoid the calculation failure!
Since:
2017

Autodesk.Revit.DB.WorkerProgressNotifier
An interface to mark the progress of secondary data calculation in worker
Since:
2017